; domain
(define (domain gripper-strips)
  (:types room ball gripper)

   (:predicates (at-robby ?r - room)
		(at ?b - ball ?r - room)
		(free ?g - gripper)
		(carry ?b - ball ?g - gripper))

   (:action move
       :parameters  (?o1 ?o2 - room)
       :precondition (and (at-robby ?o1))
       :effect (and  (at-robby ?o2)
		     (not (at-robby ?o1))))



   (:action pick
       :parameters (?o1 - ball ?o2 - room ?o3 - gripper)
       :precondition  (and  (at ?o1 ?o2) (at-robby ?o2) (free ?o3))
       :effect (and (carry ?o1 ?o3)
		    (not (at ?o1 ?o2)) 
		    (not (free ?o3))))


   (:action drop
       :parameters (?o1 - ball ?o2 - room ?o3 - gripper)
       :precondition  (and  (carry ?o1 ?o3) (at-robby ?o2))
       :effect (and (at ?o1 ?o2)
		    (free ?o3)
		    (not (carry ?o1 ?o3)))))

; problem
(define (problem strips-gripper-x-2)
  (:domain gripper-strips)
  (:objects ball6 -  ball ball7 -  ball roomb -  room rooma -  room ball5 -  ball ball4 -  ball ball3 -  ball ball2 -  ball ball1 -  ball left -  gripper right -  gripper )
  (:init (at ball3 rooma) (at ball4 rooma) (at ball5 rooma) (at ball1 rooma) (at ball2 roomb) (at-robby roomb) (at ball6 roomb) (free right) (at ball7 roomb) (free left) )
  (:goal (and (at ball4 rooma)(at ball1 rooma)(at ball2 roomb)(at ball6 roomb)(at ball7 roomb)(carry ball5 right)(at-robby roomb)(at ball3 roomb)(free left)(not (at-robby rooma))(not (at ball7 rooma))(not (at ball6 rooma))(not (at ball5 rooma))(not (at ball5 roomb))(not (at ball4 roomb))(not (at ball3 rooma))(not (at ball2 rooma))(not (at ball1 roomb))(not (free right))(not (carry ball7 left))(not (carry ball7 right))(not (carry ball6 left))(not (carry ball6 right))(not (carry ball5 left))(not (carry ball4 left))(not (carry ball4 right))(not (carry ball3 left))(not (carry ball3 right))(not (carry ball2 left))(not (carry ball2 right))(not (carry ball1 left))(not (carry ball1 right)))))

; plan
1. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 25 of 32
2. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 24 of 32
3. (pick ball5 rooma right)
   deleted: (at ball5 rooma) (free right)
   added: (carry ball5 right)
   goals met: 27 of 32
4. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 29 of 32
5. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 32 of 32
